---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewBoundingBoxUV
source: html/29341e4a-ffd6-27ed-5a90-cbb6ff70f435.htm
---
# Autodesk.Revit.Creation.Application.NewBoundingBoxUV Method

Creates an empty two-dimensional rectangle.

## Syntax (C#)
```csharp
public BoundingBoxUV NewBoundingBoxUV()
```